# Respostas

     Questão 1:

In [ ]:
import pandas as pd 
import numpy as np

In [5]:
Mercearia = pd.DataFrame({"loja":["A", "A", "A"],
"dia": ["sex", "sab", "dom"],
"valor": [7500, 9500, 8200]})
Farmácia = pd.DataFrame({"loja":["B", "B", "B"],
"dia": ["sex", "sab", "dom"],
"valor": [5100, 8250, 9900]})
Restaurante = pd.DataFrame({"loja":["C", "C"],
"dia": ["sab", "dom"],
"valor": [7500, 11800]})

In [10]:
#Sentido linha 
pd.concat([Mercearia, Farmácia, Restaurante],axis =1 )

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

In [11]:
#Sentido Coluna
pd.concat([Mercearia, Farmácia, Restaurante])

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900
0    C  sab   7500
1    C  dom  11800

R: A primeira imprime a saida em linha, a segunda imprime a saida em coluna,a ocorrencia de NaN no primeiro se da porque nao existe o 3 valor da 3 linha no dataframe de origem, ai exibe os valores NaN para deixar as linhas em formato certo, na segunda nao tem pois so imprime os valores dados.

    Questão 2:

In [12]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})
PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

In [24]:
#A
alunos = pd.concat([SQL, PYTHON], ignore_index=True)
alunos = alunos.drop_duplicates()
print("Alunos distintos:")
print(alunos)

Alunos distintos:
                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
2           ana@xyz.com
3  jonas@acmecorpus.com

In [25]:
#B
print("O(s) aluno(s) que fizeram ambos os cursos:")
ambos = pd.merge(SQL,PYTHON)
print(ambos)

O(s) aluno(s) que fizeram ambos os cursos:
            email
0  rakesh@xyz.com

In [26]:
#C
sosql = SQL[SQL.email.isin(PYTHON.email)==False]
sopython = PYTHON[PYTHON.email.isin(SQL.email)==False]
print('Alunos que fizeram só o curso de SQL:')
print(sosql)
print('Alunos que fizeram só o curso de Python:')
print(sopython)

Alunos que fizeram só o curso de SQL:
                email
1  ecg@acmecorpus.com
Alunos que fizeram só o curso de Python:
                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

    Questão 3

In [35]:
dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto": ["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]
}
dic_func = {"num":[3199,3269,3555,3788,3844],
"nome": ["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto": ["D2","D3",None,"D2","D4"]
}
empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

In [41]:
empdados = pd.merge(funcionarios, empresa, left_on='idDepto', right_on='id')
print('Dados da empresa:')
print(empdados)

Dados da empresa:
    num    nome  salario idDepto  id nomDepto local
0  3199     Ana     1600      D2  D2       RH    RJ
1  3788  Marina     5000      D2  D2       RH    RJ
2  3269   David     2975      D3  D3       TI    RJ
3  3844    Luís     3000      D4  D4   Vendas    SP